Tekla Open API Reference for Tekla Structures 2025
PropertyLocalizer Methods
The Localization.Util.PropertyLocalizer type exposes the following members.
Methods
Name | Description
Localize
 Localizes the object with the given localization instance.
Top
See Also
Reference
Localization.Util.PropertyLocalizer Class
Tekla.Structures.Dialog Namespace